<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
    <title>Isaac Newton</title>
    <link rel="stylesheet" type="text/css" href="./isaac.css" />
</head>
<body>
    <h1>
        Isaac Newton, el cient&iacute;fico de la <span class="underline">manzana</span>
    </h1>
    <div>
        <p>
            Sir <a href="https://es.wikipedia.org/wiki/Isaac_Newton" class="border">Isaac Newton</a> (4 de enero de 1643 GR &#45; 31 de marzo de 1727 en <a href="https://es.wikipedia.org/wiki/Gran_Breta%C3%B1a">Gran Breta&ntilde;a</a>) fue un <span>f&iacute;sico</span>, fil&oacute;sofo,
            inventor, alquimista y matem&aacute;tico ingl&eacute;s, autor de los Philosophiae naturalis principia mathematica, m&aacute;s
            conocidos como los Principia, donde describi&oacute; la ley de gravitaci&oacute;n universal y estableci&oacute; las bases de la
            Mec&aacute;nica Cl&aacute;sica mediante las leyes que llevan su nombre. Entre sus otros descubrimientos cient&iacute;ficos
            destacan los trabajos sobre la naturaleza de la luz y la &oacute;ptica (que se presentan principalmente en su obra
            &Oacute;ptica (libro)) y el desarrollo del c&aacute;lculo matem&aacute;tico.
        </p>
    </div>
    <div>
        <p>
            Newton fue el primero en demostrar que las leyes naturales que gobiernan el movimiento en la <a href="https://es.wikipedia.org/wiki/Tierra" class="border">Tierra</a> y las
            que gobiernan el movimiento de los cuerpos celestes son las mismas. Es, a menudo, calificado como el
            cient&iacute;fico m&aacute;s grande de todos los tiempos, y su obra como la culminaci&oacute;n de la <a href="https://es.wikipedia.org/wiki/Revoluci%C3%B3n_cient%C3%ADfica" class="border">Revoluci&oacute;n cient&iacute;fica. </a> 
        </p>
    </div>
    <div>
        <p>
            Entre sus hallazgos cient&iacute;ficos se encuentran los siguientes: el descubrimiento de que el espectro de color que
            se observa cuando la luz blanca pasa por un prisma es inherente a esa luz, en lugar de provenir del prisma
            (como hab&iacute;a sido postulado por Roger Bacon en el siglo XIII); su argumentaci&oacute;n sobre la posibilidad de que
            la luz estuviera compuesta por part&iacute;culas; su desarrollo de una ley de convecci&oacute;n t&eacute;rmica, que describe la tasa
            de enfriamiento de los objetos expuestos al aire; sus estudios sobre la velocidad del sonido en el aire; y su
            propuesta de una teor&iacute;a sobre el origen de las estrellas. 
        </p>
    </div>
    <h1>
        Albert Einstein, la <span class="underline">f&iacute;sica moderna</span>
    </h1>
    <div>
        <p class="green">
            <a href="https://es.wikipedia.org/wiki/Albert_Einstein">Albert Einstein</a> (Ulm, 14 de marzo de 1879 &#45; Princeton, 18 de abril de 1955) fue un <span id="bold">f&iacute;sico</span> de origen alem&aacute;n,
            nacionalizado posteriormente suizo y estadounidense. Est&aacute; considerado como el cient&iacute;fico m&aacute;s importante del
            siglo XX, adem&aacute;s de ser el m&aacute;s conocido.
        </p>
    </div>
    <div>
        <p class="green">
            En 1905, siendo un joven f&iacute;sico desconocido, que estaba empleado en la Oficina de Patentes de Berna, en
            (<a href="https://es.wikipedia.org/wiki/Suiza">Suiza</a>), public&oacute; su teor&iacute;a de la relatividad especial. En ella incorpor&oacute;, en un marco te&oacute;rico simple,
            fundamentado en postulados f&iacute;sicos sencillos, conceptos y fen&oacute;menos estudiados anteriormente por Henri
            Poincar&eacute; y por Hendrik Lorentz. Probablemente, la ecuaci&oacute;n m&aacute;s conocida de la f&iacute;sica a nivel popular, es la
            expresi&oacute;n matem&aacute;tica de la equivalencia masa-energ&iacute;a, <span class="emc">E=mc&sup2;</span>, deducida por &eacute;l como una consecuencia l&oacute;gica
            de esta teor&iacute;a. Ese mismo a&ntilde;o public&oacute; otros trabajos que sentar&iacute;an algunas de las bases de la f&iacute;sica estad&iacute;stica
            y la mec&aacute;nica cu&aacute;ntica.
        </p>
    </div>
    <div>
        <p class="green" id="redborder">
            En 1915 present&oacute; la <span id="bold2">Teor&iacute;a General de la Relatividad</span>, en la que reformul&oacute; por completo el concepto de
            gravedad. Una de las consecuencias fue el surgimiento del estudio cient&iacute;fico del origen y evoluci&oacute;n del
            Universo por la rama de la f&iacute;sica denominada cosmolog&iacute;a. En 1919, cuando las observaciones brit&aacute;nicas de un
            eclipse solar confirmaron sus predicciones acerca de la curvatura de la luz, fue idolatrado por la prensa.3
            Einstein se convirti&oacute; en un icono popular de la ciencia mundialmente famoso, un privilegio al alcance de muy
            pocos cient&iacute;ficos.
        </p>
    </div>
</body>
</html>
