<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
    <title>Evoluci&oacute;n de la inform&aacute;tica</title>
    <link rel="stylesheet" type="text/css" href="./evo.css" />
</head>
<body>
    <div>
        <div id="div1">
            <div id="div2">
                <h1>
                    Evoluci&oacute;n de la inform&aacute;tica
                </h1>
            </div>
        </div>
        <div class="d2">
            <p class="green">
                En esta p&aacute;gina se hace un breve repaso sobre los antecendentes del ordenador y se enumeran los aspectos
                principales de las distintas generaciones de ordenadores.
            </p>
            <p class="green">
                El ordenador en la forma en que actualmente lo conocemos no tiene m&aacute;s de cuatro o cinco d&eacute;cadas, lo que
                significa que hasta ese momento <span class="bold">no exist&iacute;a una ciencia inform&aacute;tica</span>. No obstante podemos enumerar una serie
                de antecendentes hist&oacute;ricos que condujeron a la aparici&oacute;n del ordenador. 
            </p>
        </div>
        <div class="d3">
            <ul>
                <li>
                    La calculadora m&aacute;s antigua utilizada por el hombre son las manos, a trav&eacute;s de las cuales el hombre realiza sus
                    primeros c&aacute;lculos. Pronto comienza a utilizar objetos de la naturaleza como trozos de madera y peque&ntilde;as
                    piedras para realizar c&aacute;lculos mas complicados. Pero para operaciones con n&uacute;meros grandes este m&eacute;todo es
                    muy limitado.
                </li>
                <li>
                    El paso siguiente es asignar un valor simb&oacute;lico a un objeto. Hasta ahora el valor de un objeto
                    era 1, la unidad. A partir de ahora un objeto puede significar 5, 10 o cualquier cantidad que se le asigne. Esto
                    hace que aparezcan los primeros objetos creados con el &uacute;nico prop&oacute;sito de realizar c&aacute;lculos, como por
                    ejemplo, el &aacute;baco. El <span class="yellow"><span class="bold">&aacute;baco</span> se compone de un marco de madera en el que hay tendidos una serie de hilos o
                    varillas. En cada uno de ellos se insertan una serie de cuentas que permiten almacenar cantidades y realizar
                    operaciones b&aacute;sicas de suma y resta.</span>
                </li>
                <li>
                    <span class="yellow">La calculadora que alcanz&oacute; mayor difusi&oacute;n fue la desarrollada en el siglo
                    XVII por el fil&oacute;sofo <span class="bold">Pascal</span></span>, que a la edad de 19 a&ntilde;os desarroll&oacute; su "Pascalina", que pod&iacute;a realizar sumas y
                    restas. Esta calculadora estaba basada en una serie de engranajes y ruedas dentadas. La base de las
                    operaciones consist&iacute;a en contar los dientes de un engranaje, al igual que un cuentakil&oacute;metros. A finales de ese
                    siglo Leibnitz mejor&oacute; esta m&aacute;quina ampliando sus capacidades a las operaciones de multiplicar y dividir.
                    <p>
                        Las computadoras se diferencian de las calculadoras en que poseen un programa, el cual puede ser modificado
                        para que la m&aacute;quina realice diferentes operaciones, mientras que en las calculadoras este programa ya ha sido
                        prefijado a la hora de su fabricaci&oacute;n y no se puede cambiar. 
                    </p>
                </li>
                <li>
                    Babbage desarroll&oacute; en 1834 la <span class="bold">M&aacute;quina Anal&iacute;tica</span>. Era capaz de realizar cualquier c&aacute;lculo y de almacenar
                    programas, pero la m&aacute;quina qued&oacute; incompleta debido a la tecnolog&iacute;a de la &eacute;poca. 
                </li>
            </ul>
        </div>
        <p>
            Los ordenadores que han ido apareciendo desde los a&ntilde;os 40 se han agrupado en diferentes generaciones: 
        </p>
        <div class="d4">
            <h2>
                Primera <span class="greenborder">generaci&oacute;n</span> (1940-1960)
            </h2>
            <p>
                La Universidad de Harvard establece un acuerdo con la empresa IBM para crear un computador de car&aacute;cter
                general. Esta m&aacute;quina estuvo operativa en 1944 y se denomin&oacute; <span class="bold">Mark I</span>. Ten&iacute;a la capacidad de almacenar 72
                n&uacute;meros de 23 cifras. Era un ordenador muy lento, <span class="yellow">necesitando diez segundos para realizar una multiplicaci&oacute;n
                y once para una divisi&oacute;n. </span>
            </p>
            <p>
                <span class="yellow">En 1947 se construy&oacute; en EEUU la <span class="bold">ENIAC</span>, que fue la primera</span> computadora propiamente dicha. Esta m&aacute;quina
                ocupaba todo un s&oacute;tano de la universidad y pesaba 30 toneladas, pero era capaz de realizar cinco mil
                operaciones aritm&eacute;ticas en un segundo. Lo que MARK I realizaba en una semana, ENIAC lo hac&iacute;a en una
                hora. 
            </p>
            <p>
                El proyecto del ENIAC culmin&oacute; dos a&ntilde;os despu&eacute;s, cuando se integr&oacute; el ingeniero <span class="bold">John von Neumann</span>; sus
                ideas resultaron tan fundamentales para el desarrollo posterior que es considerado el <span class="bold">padre de las
                computadoras. </span>
            </p>
            <p>
                Todas las computadoras de esta generaci&oacute;n est&aacute;n basadas en la utilizaci&oacute;n de las <span class="bold">v&aacute;lvulas de vac&iacute;o</span>. Estos
                componentes, adem&aacute;s del gran espacio que ocupaban y de que supon&iacute;an un alto consumo de electricidad, eran
                muy propensos a aver&iacute;as constantes. 
            </p>
        </div>
        <div class="d5">
            <h2>
                Segunda <span class="greenborder">generaci&oacute;n</span> (1960-1965)
            </h2>
            <p>
                Se caracteriza por el cambio de la v&aacute;lvula de vac&iacute;o por <span class="bold">transistores</span> y por un <span class="bold">aumento de la capacidad de
                memoria</span>. Los circuitos con transistores, reducen el tama&ntilde;o y el consumo el&eacute;ctrico de las m&aacute;quinas y
                aumentan su fiabilidad. El transistor es un dispositivo electr&oacute;nico formado por un cristal de silicio. Su
                funcionamiento es sencillo: tiene dos posibilidades, transmitir o no transmitir electricidad. 
            </p>
            <p>
                Su aparici&oacute;n hizo que las computadores fuesen m&aacute;s r&aacute;pidas peque&ntilde;as y baratas. En esta generaci&oacute;n se
                ampliaron las memorias auxiliares y se crearon los discos magn&eacute;ticos de gran capacidad. Se dise&ntilde;aron las
                impresoras y se desarrollaron los lenguajes de programaci&oacute;n de alto nivel. El primer ordenador con
                transistores, el <span class="bold">ATLAS 1962</span>, se construy&oacute; en 1956. 
            </p>
        </div>
        <div class="d6">
            <h2>
                Tercera <span class="greenborder">generaci&oacute;n</span> (1965-1975) 
            </h2>
            <p>
                Se caracteriza por la revolucionaria aparici&oacute;n de los <span class="bold">circuitos integrados (chips)</span> realizados a base de silicio.
                Con ellos se abren la puertas a la miniaturizaci&oacute;n. Los ordenadores de esta &eacute;poca experimentan un aumento
                de la velocidad, y el uso de mayor n&uacute;mero de programas y lenguajes de programaci&oacute;n. Aparecen los sistemas
                operativos para el control de la computadora. 
            </p>
            <p>
                El primer aparato basado totalmente en circuitos integrados es el <span class="bold">IBM Serie 360</span>. 
            </p>
        </div>
        <div class="d7">
            <h2>
                Cuarta <span class="greenborder">generaci&oacute;n</span> (1975-1985) 
            </h2>
            <p>
                La caracter&iacute;stica m&aacute;s importante de esta generaci&oacute;n es la aparici&oacute;n de los <span class="bold">microprocesadores</span>, que son
                circuitos con gran cantidad de transistores integrados en un peque&ntilde;o espacio. Con ellos se reduce el tama&ntilde;o y
                el coste de los computadores y mejora la velocidad de c&aacute;lculo. 
            </p>
            <p>
                Se abre una nueva era con la aparici&oacute;n de las <span class="bold">Computadoras Personales o PCs</span>. En 1976 dos estudiantes
                fabrican en el garaje de su casa la primera microcomputadora del mundo y m&aacute;s tarde fundan la compa&ntilde;&iacute;a
                <span class="bold">App</span><span id="bold1">le</span><span class="yellow">. En 1981 <span class="bold">IBM</span> lanza al mercado su primer PC.</span>
            </p>
            <p>
                <span class="yellow">Esta &uacute;ltima m&aacute;quina (basada en el microprocesador Intel 8088) tenia una caracter&iacute;stica muy interesante: su
                nuevo sistema operativo,<span class="bold">MS</span></span><span id="bold2">-DOS</span>, que hac&iacute;a que el uso de la computadora fuera mucho m&aacute;s f&aacute;cil. 
            </p>
        </div>
        <div class="d8">
            <h2>
                Quinta <span class="greenborder">generaci&oacute;n</span> (1985-actualidad) 
            </h2>
            <p>
                Podemos hablar de una quinta generaci&oacute;n que lleva aparejada una reducci&oacute;n todav&iacute;a mayor y una gran
                portabilidad de los equipos y un desarrollo impresionante de los <span class="bold">programas de aplicaci&oacute;n</span> de forma que sirvan
                para casi cualquier prop&oacute;sito. A partir de 1990 llega la explosi&oacute;n de las <span class="bold">comunicaciones entre ordenadores</span>,
                finalizando el trabajo individual con un ordenador y comenzando la comuniaci&oacute;n total entre cualquier tipo de
                ordenador, tanto de forma local como mundial, mediante la utilizaci&oacute;n de redes.
            </p>
            <p>
                En la actualidad la miniaturizaci&oacute;n de los componentes llega a su m&aacute;xima expresi&oacute;n con la realizaci&oacute;n de
                diminutos procesadores como <span class="bold">Cell</span>, construido por IBM, Sony y Toshiba y utilizado en la consola de &uacute;ltima
                generaci&oacute;n PlayStation 3. 
            </p>
        </div>
    </div>
</body>
</html>
