<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
    <title>CSS: selectores avanzados</title>
    <link rel="stylesheet" type="text/css" href="./CSS_Ext/css4.css" />
</head>
<body>
    <h1>Gladiator</h1>
    <h2>Descripci&oacute;n</h2>
    <p>
        Gladiator es una pel&iacute;cula de 2000, del g&eacute;nero peplum.
    </p>
    <p>
        Dirigida por Ridley Scott y con <a href="http://es.wikipedia.org/wiki/Russell_Crowe">Russell Crowe</a>, Joaqu&iacute;n Phoenix, Connie Nielsen, Djimon Hounsou, Oliver Reed y Richard Harris en los papeles principales.
    </p>
    <h2>Sinopsis</h2>
    <p>
        El gran general romano M&aacute;ximo ha vuelto a regresar victorioso con sus legiones del campo de batalla. Ahora s&oacute;lo sue&ntilde;a con el regreso al hogar junto a su esposa e hijo. Pero el agonizante emperador Marco Aurelio tiene una nueva misi&oacute;n para &eacute;l: heredar su corona.
    </p>
    <p>
        Celoso del favor de que goza M&aacute;ximo con el emperador, el heredero del trono Comodo ordena su ejecuci&oacute;n y la de su familia. M&aacute;ximo escapa a su destino pero se convierte en esclavo. Entrenado como gladiador, su fama crece en la arena. Vuelve a Roma decidido a vengar la muerte de su familia matando al nuevo emperador Comodo.
    </p>
    <p>
        M&aacute;ximo ha descubierto que la voluntad del pueblo supera al poder del emperador y sabe que s&oacute;lo podr&aacute; ejecutar su venganza si se convierte en el mayor h&eacute;roe del imperio.
    </p>
    <h2>Premios</h2>
    <p>
        Gladiator fue nominado en 36 ceremonias distintas, incluyendo la 73a entrega de los Premios &Oacute;scar, los premios BAFTA y los Globos de Oro. De 119 nominaciones en total, la pel&iacute;cula gan&oacute; 48 premios.
    </p>
    <p>
        La pel&iacute;cula gan&oacute; 5 premios de la Academia y fue nominada para otras 7, incluyendo Mejor Actor de Reparto (Joaqu&iacute;n Phoenix) y Mejor Director (Ridley Scott). Hubo una controversia por su nominaci&oacute;n para Mejor Banda Sonora, pues el premio fue propuesto &uacute;nicamente para Hans Zimmer y no para Lisa Gerrard.
    </p>
    <p>
        Sin embargo, los dos <b>ganaron el <a href="http://es.wikipedia.org/wiki/Globo_de_oro">Globo de Oro</a> por Mejor Banda Sonora</b> como co-escritores. Tambi&eacute;n hubo cierta pol&eacute;mica cuando Joaqu&iacute;n Phoenix (C&oacute;modo, nominado a Mejor Actor de Reparto) no recibi&oacute; la estatuilla por su interpretaci&oacute;n.
    </p>
    <h2>Comentarios</h2>
    <p>
        El esp&iacute;ritu &eacute;pico de la pel&iacute;cula, las intensas escenas de batalla as&iacute; como la carga emocional de los personajes fueron ampliamente reconocidos. El &eacute;xito de &eacute;sta pel&iacute;cula pudo haber ayudado a resucitar el g&eacute;nero &eacute;pico hist&oacute;rico, casi 40 a&ntilde;os despu&eacute;s de Cleopatra (1963), con pel&iacute;culas subsecuentes tales como Troya (2004), Alejandro Magno (2004), Kingdom of Heaven (2005) y 300 (2007).
    </p>
    <h2>Curiosidades</h2>
    <ul>
        <li>
            <p>
                Seg&uacute;n la versi&oacute;n en espa&ntilde;ol, el personaje de M&aacute;ximo <b>no vivi&oacute; en <a href="http://es.wikipedia.org/wiki/M%C3%A9rida_(Espa%C3%B1a)">M&eacute;rida</a> sino en un pueblo cercano</b> en donde actualmente se ubica la localidad de Arroyo de San Serv&aacute;n, ya que Calamonte est&aacute; antes de las colinas, y tras las colinas (o sierra) est&aacute; Arroyo de San Serv&aacute;n (Badajoz).
            </p>
        </li>
        <li>
            <p>
                En la versi&oacute;n original del film, M&aacute;ximo dice que es de cerca de "Trujillo" y no de Emerita Augusta, como se dobl&oacute; en la versi&oacute;n en castellano. Se ha de se&ntilde;alar adem&aacute;s, que en la versi&oacute;n original se comete el error de nombrar a la ciudad espa&ntilde;ola como Trujillo (nombre actual) y no Turgalium (nombre en &eacute;poca romana). El error es del director. Dado que la ciudad m&aacute;s conocida en la regi&oacute;n era Emerita Augusta, al traducirla al espa&ntilde;ol se opt&oacute; por ese nombre.
            </p>
        </li>
    </ul>
    <p>
        <a href="http://validator.w3.org/check?uri=referer">
            <img src="http://www.w3.org/Icons/valid-xhtml10" alt="Valid XHTML 1.0 Strict" height="31" width="88" />
        </a>
        <a href="http://jigsaw.w3.org/css-validator/check/referer">
            <img style="border:0;width:88px;height:31px"
                src="http://jigsaw.w3.org/css-validator/images/vcss"
                alt="¡CSS Válido!" />
        </a>
    </p>
</body>
</html>
